[{"id":30016,"company":"FINCA UCO CJSC","title":"Internal Control Specialist","term":"Full-time","duration":"Permanent","location":"Yerevan, Armenia","job_description":"FINCA UCO CJSC is looking for a motivated candidate to fill in the position of Internal Control Specialist. As a member of the Internal Control Department Team, the incumbent will support the Department Manager displaying a systematic and disciplined approach to the effectiveness of risk management and control of all processes of the Company.","job_responsibilities":"- Study and analyze the processes regarding particular fields of the Company in order to improve the processes;- Conduct analyses based on the databases, reveal operational and other risks, make recommendations to mitigate, manage or minimize them, and provide consultation;- Discover and analyze the factors in the external environment, that can influence the Company's performance;- Check the compliance of the Company's business processes with the internal and external laws and regulations;- Carry out regular and extraordinary verifications of crediting processes and of other fields that are not related to the field of crediting;- Conduct post-verification activities and monitoring;- Investigate and conduct cause-and-effect analysis of fraud cases; reveal any possible gaps in the internal control system;   - Deliver reports detailing the conclusions from his/ her control activities, infringements, incompliances and recommendations;- Perform other tasks relevant to the job.","required_qualifications":"- Higher education, preferably in Finance, Mathemathics, Economics or other relevant field;- At least 1 year of work experience in the financial/ banking, audit/ internal control fields is preferred;- Ability to make conclusions from a great deal and various information;- Analytical mindset aimed to discover risks, attention to details; - Knowledge of the legislation of banks and credit organizations is an asset;- PC skills: MS Office (Word and Excel);- Strong communication skills;- Reliability, honesty and ability to meet tight deadlines independently;- Ability to solve conflicts efficiently;- Team work skills;- Fluency in Armenian and English languages;- Readiness to go on business trips inside Armenia.","application_procedures":"If you meet the requirements above and are interested in the position announced, please e-mail your detailed CV to: <a href=\"mailto:hr@finca.am\">hr@finca.am</a> . Please, specify the subject line of your email as \"Internal Control Specialist\".  Please clearly mention in your application letter that you learned of this job opportunity through Career Center and mention the URL of its website - <a target=\"_blank\" href=\"http://www.careercenter.am\">www.careercenter.am</a>, Thanks.","opening_date":"17 November 2017","application_deadline":"16 December 2017","about_company":"FINCA CJSC is a universal credit organization, operating in Armenia for more than 17 years. With headquarters in Washington, DC, FINCA reaches over 1.8 million clients through its 21 subsidiaries in Africa, Eurasia, the Middle East and South Asia, and Latin America."},{"id":30017,"company":"KPMG Armenia CJSC","title":"Lawyer","open_to/ eligibility criteria":"All interested candidates","location":"Yerevan, Armenia","job_description":"KPMG Armenia CJSC is looking for a Lawyer.","job_responsibilities":"- Responsible for legal consulting of the clients on various issues of private law (e.g. corporate, M&amp;A, commercial, labour, insolvency, etc.);- Carry out research and legal analysis related to issues in different industries (banking, industry, construction, pharmacy, mining, energy, telecommunication, FMCG, public sector, etc.);- Prepare legal opinions, assist in legal due diligence projects, structure and offer full legal support of M&amp;A and other kinds of transactions;- Legally support and structure infrastructure projects;- Communicate with clients and maintain successful client relationships;- Participate in marketing activities of the department.","required_qualifications":"- Master's degree in Law; international degree (LLM/ JD) would be an advantage;- At least 2 years of experience in a reputable local law firm;- High degree of professional ethics and integrity;- Strong knowledge of civil, corporate and commercial law;- Excellent computer literacy;- High sense of ownership, responsibility and ability to work under pressure;- Excellent knowledge of English and Russian languages for working with clients and documentation;- Strong communication skills.","application_procedures":"To apply for this position, please register in KPMG's Global Applicant Tracking System at: <a target=\"_blank\" href=\"https://krb-sjobs.brassring.com/TGWebHost/jobdetails.aspx?partnerid=30008&amp;siteid=5049&amp;AReq=128717BR\">https://krb-sjobs.brassring.com/TGWebHost/jobdetails.aspx?partnerid=30008&amp;siteid=5049&amp;AReq=128717BR</a> , and complete the application online to participate in the Lawyer position recruitment for the Yerevan office. You will be able to track your application on your personal page. Please contact the Company at: <a href=\"mailto:general@kpmg.co.am\">general@kpmg.co.am</a> if you have any questions about the use of the KPMG Recruitment System. KPMG Armenia thanks all interested candidates, however only short listed candidates registered in the KPMG Recruitment System will be contacted for a test.  Please clearly mention in your application letter that you learned of this job opportunity through Career Center and mention the URL of its website - <a target=\"_blank\" href=\"http://www.careercenter.am\">www.careercenter.am</a>, Thanks.","opening_date":"17 November 2017","application_deadline":"01 December 2017","about_company":"KPMG operates in 152 countries with over 189,000 people working in member firms around the world. To learn more about KPMG Armenia CJSC, please visit: <a target=\"_blank\" href=\"http://www.kpmg.am\">www.kpmg.am</a>."},{"id":30018,"company":"Alpha Food Service LLC","title":"Import and Logistics Manager","term":"Full-time","open_to/ eligibility criteria":"All interested candidates.","start_date/ time":"ASAP","duration":"Long-term, with 3 months of probation period.","location":"Yerevan, Armenia","job_description":"Alpha Food Service LLC is looking for an experienced, motivated and initiative professional to take up the position of Import and Logistics Manager.","job_responsibilities":"- Plan, manage and coordinate logistics, warehouse and transportation; organize the import of the required products to Armenia;- Responsible for intensive negotiation and correspondence with the suppliers and transportation companies over the supplied goods and shipping dates, prices and other conditions;- Analyze all aspects of corporate logistics to determine the most cost-effective or efficient means of transporting products/ supplies and give recommendations to the upper management; - Make inquiries to forwarding companies in order to get the best quotes for transportation, collaborate with them and organize transportation of goods; - Check the documentation received from the supplier, make necessary documentation packages for organizing the process of orders' shipping, customs clearance (contracts, invoices, shipping documents, applications, necessary packages for customs clearance, etc.);- Control and ensure that all the shipments are carried out in compliance with the customs rules and regulations, collaborate with customs service, supervise the customs clearance of received cargoes;- Actively participate in the whole process of import and logistics, input appropriate information into the computer program;- Responsible for cooperation with other departments of the Company for the purpose of effective supply chain management;- Regularly report to the management on status of purchase orders, goods in transit, payment schedules, expected sales volume and marketing plans.","required_qualifications":"- BA in Logistics, Business Administration, Economics, Mathematics or a related field;- Work experience in a relevant field;- Thorough knowledge of transportation, logistics, customs clearance procedures and import regulation (knowledge of warehousing and logistics procedures and standards, international shipping, customs and tax requirements, etc.);- Excellent written and verbal communication skills, business correspondence and decision-making skills;- Proficiency in Microsoft Office suite and PC in general; knowledge of 1C is preferable;- Fluency in Armenian, Russian and English languages, both written and spoken;- Knowledge of any other European language is a plus; - Analytical and tactical thinking;- Ability to work under pressure, concentrate quickly, act accordingly and proactively;- Commitment, stress resistance, sense of responsibility and punctuality.","remuneration_salary":"Competitive, based on skills and experience.","application_procedures":"Candidates meeting above-listed requirements can send their CV to: <a href=\"mailto:hr@foodservice.am\">hr@foodservice.am</a> , mentioning in the subject line \"Import and Logistics Manager\". The shortlisted candidates will be invited for interviews.  Please clearly mention in your application letter that you learned of this job opportunity through Career Center and mention the URL of its website - <a target=\"_blank\" href=\"http://www.careercenter.am\">www.careercenter.am</a>, Thanks.","opening_date":"17 November 2017","application_deadline":"11 December 2017","about_company":"Founded in 2005, Alpha Food Service LLC is a leading supplier of premium alcoholic beverages, foodstuff and food raw materials for hotels, restaurants, cafes (HoReCa), pastries and bakeries in Armenia and Nagorno Karabakh Republic. The company offers wide and regularly expanding range of products from leading international producers: syrups, butter, milk and creams from France, olive oil, balsamic vinegars, exclusive coffee, creams, margarine, chocolate and pastry tools from Italy, pastry ingredients and liqueurs from Netherlands, bakery mixes and improvers from Germany and many other products."},{"id":30019,"company":"4h LLC","title":"Senior QA Engineer","start_date/ time":"ASAP","duration":"Long-term","location":"Yerevan, Armenia","job_description":"4h is searching for a result-oriented agile professional to fulfill the position of Senior QA Automation Engineer. The product is cloud based multi country training management platform.","job_responsibilities":"- Perform complex functional, integration and regression testing on complex web applications.- Analyse requirements or user stories across products and applications to identify acceptance criteria, testing cases and test scenarios;- Work closely with multiple development teams to ensure quality testing practices are incorporated across the development cycle;- Write test documentation such as test cases, scenarios, and create test data;- Be involved in the preparation of Test Estimation, Test Strategy/ Plan, Test Case execution and Defect report;- Plan, implement and maintain automated test scripts. Develop Automated Regression Test Suite using Selenium and Java and PHP, Behat and Mink;- Maintain test environments to ensure sufficient coverage for all Company's projects;- Deploy code into QA environment, as needed;- Proactively initiate, develop, and maintain effective working relationships with team members.","required_qualifications":"- Bachelor's honours degree (4 years) or Master's degree in Computer Science;- At least 5 years of proven experience using the full spectrum of software testing methodologies on software applications preferably web applications;- Knowledge of programming concepts and experience in writing code in software programming languages Java and PHP;- Experience in the test automation of web based applications;- Experience with various testing tools including automation tools such as Selenium WebDriver, etc.;- Ability to maintain and build on existing automation framework in Java and PHP;- Experience in structuring QA test repository and automation suites based on application's functional and component structure;- Strong knowledge in web application UI models and how components interact via internet protocols (HTTP, SSL, Email, SOAP and XML);- Strong skills in observing/ analysing issues and communicating issues with clear and precise description;- Experience using defect management tools;- Basic SQL database query knowledge;- Excellent communication skills in English language;- Work with minimal management supervision;- Experience with Scrum, XP, or other Agile methodologies is desired.","application_procedures":"All interested candidates are kindly asked to submit their CVs to: <a href=\"mailto:people@4h.am\">people@4h.am</a> . Please indicate the name of the position \"Senior QA Engineer\" in the subject line of the e-mail.  Please clearly mention in your application letter that you learned of this job opportunity through Career Center and mention the URL of its website - <a target=\"_blank\" href=\"http://www.careercenter.am\">www.careercenter.am</a>, Thanks.","opening_date":"17 November 2017","application_deadline":"16 December 2017","about_company":"4h is a software development company, consisting of 18 people, which develops cloud-based training management software as a service. The Company was founded in 2011 and works for Germany based Learnship Networks GmbH."},{"id":30020,"company":"EV Consulting CJSC","title":"Consultant","location":"Yerevan, Armenia","job_description":"EV Consulting is currently looking for a highly qualified Consultant.","job_responsibilities":"- Participate in the analysis of companies, industries and macroeconomic environments;- Carry out market studies, develop quantitative models;- Conduct financial analysis of companies, develop financial forecast models, carry out business valuation;- Help develop corporate strategies, performance improvement programs, etc.","required_qualifications":"- Educational background in Economics or Business Administration;- 2 years of solid work experience;- Excellent writing skills in Armenian, Russian and English languages;- Excellent quantitative skills; knowledge of statistical packages is a plus;- Proven analytical and research skills;- Problem-solving skills;- Ability to travel frequently outside of Armenia.","application_procedures":"If you believe you are the professional the Company is seeking for, please, forward your resume with a cover letter to: <a href=\"mailto:info@evconsulting.com\">info@evconsulting.com</a> by mentioning \"Consultant\" in the subject line of the email. Kindly please refrain from any phone calls.  Please clearly mention in your application letter that you learned of this job opportunity through Career Center and mention the URL of its website - <a target=\"_blank\" href=\"http://www.careercenter.am\">www.careercenter.am</a>, Thanks.","opening_date":"15 November 2017","application_deadline":"24 November 2017","about_company":"EV Consulting is a management advisory firm that serves companies and industries in CIS countries."},{"id":30021,"company":"IDeA Foundation","title":"Coordinator for Sub-Grant","term":"Part-time","open_to/ eligibility criteria":"All interested candidates","start_date/ time":"08 January 2018","duration":"The contract duration is 12 months (from 08 January 2018 to 08 January 2019).","location":"Yerevan, Armenia","job_responsibilities":"- Design and develop the grant award criteria;- Coordinate the pre-award planning, organization, and preparation, and the post-award administration of various grants assigned;- Advise and/ or assist as appropriate in the design, formatting and preparation of grant documentation; - Ensure strong links between the grant awarding procedures with overall goal of the project;- Oversee and monitor the implementation of Sub Grant component of the project.","required_qualifications":"- University degree, preferably in Finance or Economics;- 3 years of experience in development work in the non-profit sector, international organizations is preferred, specifically in Organizational Development (OD) or capacity development roles;- Knowledge of budgeting and fiscal management principles and procedures;- Ability to determine informational needs, to collect and analyze information, and to devise and develop statistical analyses and reports;- Excellent written and verbal communication skills in English, Armenian, and Russian languages;- Demonstrated strong oral and written communication skills, facilitation, negotiation and interpersonal skills;- Ability to work independently;- Well-developed planning, organization, and problem-solving skills.","application_procedures":"All interested candidates are kindly requested to submit their CV to: <a href=\"mailto:hr@idea.am\">hr@idea.am</a> . Please, indicate the title of the position \"Coordinator for Sub-Grant\" in the subject line of your e-mail. IDeA Foundation is grateful to all interested applicants; however, only shortlisted candidates will be contacted for the interview.  Please clearly mention in your application letter that you learned of this job opportunity through Career Center and mention the URL of its website - <a target=\"_blank\" href=\"http://www.careercenter.am\">www.careercenter.am</a>, Thanks.","opening_date":"13 November 2017","application_deadline":"01 December 2017","about_company":"IDeA (Initiatives for Development of Armenia) Charitable Foundation was established by the entrepreneurs and philanthropists Ruben Vardanyan and Veronika Zonabend. The Foundation focuses on programs which achieve tangible socioeconomic development and assist Armenia in transition from the survival model to the prosperity model. IDeA is committed to promoting social entrepreneurship in Armenia through investments in long-term, non-profit projects, as well as ensuring their sustainability."},{"id":30022,"company":"Anelik Bank CJSC","title":"Head of Collections Division","term":"Full-time","location":"Yerevan, Armenia","job_description":"Anelik Bank CJSC is looking for an experienced, motivated and qualified candidate for the position of the Head of Collections Division for realizing the responsibilities mentioned below.","job_responsibilities":"- Organize and implement measures aimed at the reduction of the overdue retail portfolio; - Identify causes of delays for customers with overdue obligations. Identify issues related to such delays and offer measures for solution of such issues; - Responsible for reduction of the weight ratio of overdue part of retail credit portfolio;- Organize and control the process of delivery of the overdue clients' files to the Legal Division;- Responsible for due implementation of current works of headed units and immediate solution of current issues.","required_qualifications":"- Higher education in Economics or Law;- At least 4-6 years of work experience, of which 3 in the field of works related to individuals' overdue credit portfolio;- Excellent knowledge of Armenian banking legislation;- Advanced computer skills (MS Office);- Readiness to travel to different regions;- Communication and team work skills;- Negotiating and problem-solving skills;- Punctuality and sense of responsibility.","application_procedures":"All interested candidates who meet the requirements above and are confident that their background and experience qualify them for this position, should send the filled-in Application Form attached to this announcement to: <a href=\"mailto:hr@anelik.am\">hr@anelik.am</a> mentioning the position title \"Head of Collections Division\" in the subject line of the e-mail.&nbsp;Only short-listed candidates will be contacted.&nbsp;  Please clearly mention in your application letter that you learned of this job opportunity through Career Center and mention the URL of its website - <a target=\"_blank\" href=\"http://www.careercenter.am\">www.careercenter.am</a>, Thanks.","opening_date":"13 November 2017","application_deadline":"24 November 2017","attachments":""},{"id":30023,"company":"FXTM Armenia","title":"Reconciliation Specialist","term":"Full-time","start_date/ time":"ASAP","duration":"Permanent, with 3 months of probation period.","location":"Yerevan, Armenia","job_description":"FXTM Armenia is looking for a candidate to fill the position of Reconciliation Specialist. The incumbent will be reporting directly to the Head of the Back Office.","job_responsibilities":"- Reconciliate clients' funds from source to trading platform on a daily basis in accordance with regulations;- Reconciliate the back office system to trading platform;- Monitor payment provider charges;- Responsible for resolving any discrepancies in a timely manner;- Organize and deliver reconciliation information to the Internal Audit and the Reporting Team;- Monitor payment providers' balances on a daily basis and request settlements/ transfers if necessary;- Process the transactions;- Responsible for reports to the Head of the Back Office.","required_qualifications":"- University degree in Accounting, Finance, Economics, Mathematics or in a related field;- 1 year experience in accounting or back office related jobs;- Profound knowledge of Microsoft Excel;- Fluency in the English language, both oral and written;- Proven analytical abilities; problem-solving and investigative skills;- Excellent time management skills to perform efficient and effective work in a fast-paced manner;- Very strong attention to details;- Ability to meet strict deadlines and work under pressure.","remuneration_salary":"Competitive, including a private medical insurance.","application_procedures":"To apply for this position, please send your CV in the English language to: <a href=\"mailto:careers@fxtm.com\">careers@fxtm.com</a> , stating the position title \"Reconciliation Officer\" in the subject line of the email. Early applications are encouraged and welcomed. All applications will be treated confidentially. Only shortlisted candidates will be contacted for the interview.  Please clearly mention in your application letter that you learned of this job opportunity through Career Center and mention the URL of its website - <a target=\"_blank\" href=\"http://www.careercenter.am\">www.careercenter.am</a>, Thanks.","opening_date":"15 November 2017","application_deadline":"14 December 2017","about_company":"FXTM Armenia is represented by FTG Consultants LLC, which is subsidiary of FXTM. FXTM is an international online forex broker. The Company serves its clients from over 180 countries in Europe, Africa and Asia by offering trading instruments, platforms and accounts, depending on needs of the customers. For more information about the Company, please visit the website at: <a target=\"_blank\" href=\"http://www.forextime.com\">www.forextime.com</a>."},{"id":30026,"company":"Deutsche Gesellschaft fuer Internationale Zusammenarbeit GIZ GmbH","title":"Driver/ Office Assistant","term":"Full-time","start_date/ time":"01 January 2018","duration":"Long-term","location":"Yerevan, Armenia","job_description":"The Driver/ Office Assistant will take account of all available information on road conditions, accessible routes and locations, and be responsible for daily operational performance of selected administrative tasks of all programme affairs.","job_responsibilities":"- Safely and responsibly perform all official travel using official vehicles;- Regularly service and look after official vehicles;- Run official errands; - Assist in managing office related events;- Perform general clerical services;- Assist the Office Manager and the Head of Administration and Finance with their tasks as instructed.Driving:- Provide passenger transport in an official car for office, project or programme staff, official visitors and guests;- Run errands for the programme or office, e.g. sending letters and messages, paying bills and buying smaller quantities of office supplies;- Help with transporting goods;- Ensure unrestricted availability of vehicles at all times and report restrictions immediately;- Complete the vehicle log book correctly and conscientiously in accordance with GIZ standards; - Use all available information (including current radio news on traffic conditions) to update daily knowledge of road conditions, current passable routes and locations, and share this information with other office drivers.Services and Secretariat Work:  - Clean the interior and exterior of the vehicle(s) regularly;- Check oil, water, brakes and brake liquid, tyre pressure, battery levels and the entire vehicle, monthly or every 5,000 km (whichever is first), headlights, brakes, bodywork for dents, etc.; - Responsible for the project vehicle documents and their good condition, keeping a vehicle log book and recording monthly maintenance;- Calculate monthly petrol, oil and lubricant consumption for the daily cash fund and for forwarding monthly vouchers to cost accounting; - Report needs for service and carry out minor repairs;- Immediately report all involvement of the project or office vehicle in accidents, including minor accidents, damage, loss or theft of vehicle fittings; - Ensure that necessary office supplies are available;- Purchase office equipment and supplies within set value limits;- Provide office receptionist services as required;- Photocopy and scan documents as needed;- Help organise events and meetings, workshops and seminars within or outside the Office; - Help prepare visitor programmes, draw up travel schedules, and organise transport of visitors; - Photocopy and scan documents as needed;- Complete forms and tables in accordance with specific instructions from the Head of Finance and Administration.Purchasing and Procurement:- In accordance with GIZ regulations, assist with local procurement of materials and equipment and order processing; - Assist with the safe transport of goods to the destination;- Assist with processing claims for damage to goods; - Document and file completed order transactions in reference files or in DMS in line with GIZ's filing rules. Customs Declarations:- Assist the officer in processing customs declaration procedures (duty-free import of goods, entering information in customs declaration database, producing statistics);- Assist with checking ship consignments; - Assist with monitoring clearing of goods;- Assist with organising and coordinating collection of goods.Vehicle Registration:- Participate in the entire process of vehicle registration (initial registration and documentation of both private and official vehicles, tax and insurance issues with project vehicles), new registrations and insurance;- Assist in forwarding registration and insurance papers to the responsible project/ programme staff;- Assist with processing accident insurance claims against local and German insurance companies, in cooperation with GIZ Head Office.Security Management:- Assist the Country Director and the country security focal point in implementation of minimum security standards.General Tasks:- Interpret for the Country Director, official visitors and guests – especially when travelling in the regions - between Armenian and English or German;- Provide input to information for GIZ staff in the country on customs issues for private goods, vehicle registration and insurance for private cars, and the GIZ office service package for outward travel.Other Duties/ Additional Tasks:- Perform other job-related duties and tasks at the request of management, participate in internal and external (team) meetings and workshops, and assist with documenting these, e.g. if necessary by taking photos;- Assist other colleagues as needed in the programme or office if there is no travel pending, and carry out other office work on request.","required_qualifications":"- Higher education;- Possession of a valid driver's licence;- At least 3 years of work experience as a Driver (with references);- Health condition allowing long-distance travel. Additional Competences:- Good knowledge of English language, ideally knowledge of German language;- Discipline and punctuality;- Resilience and patience;- Familiarity with travel in Yerevan, in the regions of Armenia and to/ in Tbilisi; - Appropriate appearance and attire and friendly manner with all passengers;- Working knowledge of ITC technologies (related to software, phone, fax, email, the internet) and computer applications (e.g. MS Office);- Good management and organisational skills;- Customer and service-oriented attitude;- Willingness to upskill as required by the tasks to be performed – corresponding measures are agreed with management.","remuneration_salary":"Negotiable","application_procedures":"Interested candidates should send a brief motivation letter, a complete CV highlighting relevant experience and education in English or in German languages, copies of all relevant educational reports and employers' references (if available) to: <a href=\"mailto:GIZ-Armenia@giz.de\">GIZ-Armenia@giz.de</a> indicating the vacancy in the subject line. With getting the automatic response \"Thank you for your email. It has been received by the GIZ Office Armenia\" the receipt is confirmed, if not, the documents should be sent to: GIZ Country Office, Reception, 4/ 1 Baghramyan Str., Yerevan. Only short-listed candidates will be contacted.  Please clearly mention in your application letter that you learned of this job opportunity through Career Center and mention the URL of its website - <a target=\"_blank\" href=\"http://www.careercenter.am\">www.careercenter.am</a>, Thanks.","opening_date":"14 November 2017","application_deadline":"28 November 2017","about_company":"The Deutsche Gesellschaft für Internationale Zusammenarbeit (GIZ) is an international cooperation enterprise for sustainable development with worldwide operations. It provides viable, forward-looking solutions for political, ecological and social development in a globalized world. GIZ promotes complex reforms and change processes, often working under difficult conditions. For more information on GIZ please visit: <a target=\"_blank\" href=\"http://www.giz.de\">www.giz.de</a>."},{"id":30027,"company":"Praemium RA LLC","title":"Full Stack .NET Developer","term":"Full-time","open_to/ eligibility criteria":"Candidates with at least 2 years of experience in software development and fluency in English language.","start_date/ time":"ASAP","duration":"Permanent","location":"Yerevan, Armenia","job_description":"The Full Stack .NET Developer will work on extending, maintaining and supporting Praemium's investment management platform technology. The platform has been developed in house and is web-based. The incumbent will work on global projects to expand the Company's applications and systems, ranging from small projects and applications, microservices fabric to its larger core systems.","job_responsibilities":"- Work with local and global teams;- Support operational aspects of the technology platform; later shift to extending the application over time.","required_qualifications":"- At least 2 years of experience in software development;- Strong capabilities with .NET framework, C# and VB.NET;- Strong capability with SQL (2014) development and stored procedures; - Good knowledge of JavaScript and web-based front-end technologies;- Knowledge of AngularJS would be an advantage;- Experience with the Microsoft development stack, including TFS, Visual Studio and Git;- Understanding of object-oriented programming;- Understanding of finance/ investment technologies is preferable;- Fluency in English language.","remuneration_salary":"Competitive, depending on the previous experience and skills, plus a medical insurance, professional development opportunities.","application_procedures":"Qualified candidates may submit their CVs in English language to: <a href=\"mailto:am.vacancies@praemium.com\">am.vacancies@praemium.com</a> . Please kindly indicate the position title \"Full Stack .NET Developer\" in the subject line of the email. Only short-listed candidates will be notified for interviews.  Please clearly mention in your application letter that you learned of this job opportunity through Career Center and mention the URL of its website - <a target=\"_blank\" href=\"http://www.careercenter.am\">www.careercenter.am</a>, Thanks.","opening_date":"15 November 2017","application_deadline":"14 December 2017","about_company":"Praemium is a wealth management solution provider with offices in Australia, the UK, Jersey, Armenia, Hong Kong and Shenzhen. The Company administers in excess of 300,000 investor accounts covering approximately 80 billion dollars in funds globally, and currently provides services to approximately 700 financial institutions and intermediaries. For more information, please visit: <a target=\"_blank\" href=\"http://www.praemium.com.au\">www.praemium.com.au</a>."},{"id":30030,"company":"TechBay LLC","title":"Junior QA Engineer","location":"Yerevan, Armenia","job_description":"TechBay LLC is looking for a talented, knowledge-driven person with analytical thinking who wants to apply for Junior QA Engineering role. The jobholder responsibilities will include: understanding product requirements, testing existing product and newly developed features of the product, writing and executing test cases, documenting and prioritizing the product issues, reporting.","job_responsibilities":"- Review and understand the upcoming product requirements;- Test existing product and newly developed features based on requirements;- Plan and estimate the test execution process;- Design and execute test cases based on product/ feature requirements;- Identify, reproduce, prioritize and document product issues;- Identify bottlenecks and devise solutions to the problems;- Periodically provide status reports of the work provided;- Continuously improve the knowledge of the product, product related fields, testing tools and testing strategies.","required_qualifications":"- Excellent analytical and multitasking skills;- Person technically inclined to software products and tools;- Higher technical education is a big plus;- Experience in mobile applications testing is a plus;- Ability to work under pressure and with deadlines;- Strong problem-solving skills;- Self-organized, fast-working, self-learning personality;- Good knowledge of English and Russian languages.","application_procedures":"All interested and qualified candidates are encouraged to send their CVs to: <a href=\"mailto:hr@zeroapp.ai\">hr@zeroapp.ai</a> .  Please clearly mention in your application letter that you learned of this job opportunity through Career Center and mention the URL of its website - <a target=\"_blank\" href=\"http://www.careercenter.am\">www.careercenter.am</a>, Thanks.","opening_date":"15 November 2017","application_deadline":"14 December 2017","about_company":"TechBay LLC works on AI based mobile email client Zero email application. Please see more at: <a target=\"_blank\" href=\"http://www.zeroapp.ai\">www.zeroapp.ai</a>."},{"id":30031,"company":"e-Works LLC","title":"PHP Developer","start_date/ time":"ASAP","duration":"Long-term","location":"Yerevan, Armenia","job_description":"e-Works LLC is looking for a PHP Developer to join its team working on international projects.","job_responsibilities":"- Develop and maintain web applications in accordance with given specifications;- Participate in project planning;- Work collaboratively and effectively on team projects;- Be flexible in learning new technologies.","required_qualifications":"- At least 3 years of work experience as a Software Developer in PHP;- Strong knowledge of PHP 5, JavaScript (jQuery and AngularJS), HTML5, CSS3 and Bootstrap;- Strong knowledge of Yii or CodeIgniter frameworks; knowledge of other frameworks is a big plus;- Strong knowledge of MySQL and MongoDB;- Good problem solving skills and ability to work independently;- Good oral and written communication skills; fluency in English language.","remuneration_salary":"High, based on the experience and skills.","application_procedures":"To apply, please submit your CV to: <a href=\"mailto:jobs@e-works.am\">jobs@e-works.am</a> , mentioning the position title in the subject line of your e-mail. The CVs will be accepted only in case the applicants follow the above-mentioned requirements. No phone calls are accepted. Only short-listed candidates will be invited for the interview.  Please clearly mention in your application letter that you learned of this job opportunity through Career Center and mention the URL of its website - <a target=\"_blank\" href=\"http://www.careercenter.am\">www.careercenter.am</a>, Thanks.","opening_date":"13 November 2017","application_deadline":"12 December 2017","about_company":"e-Works LLC is a software development company founded in 2007. It provides IT outsourcing services worldwide from Yerevan, Armenia. For more information about the Company, please visit: <a target=\"_blank\" href=\"http://www.e-works.am\">www.e-works.am</a>."},{"id":30032,"company":"TechBay LLC","title":"Base QA Engineer","location":"Yerevan, Armenia","job_description":"TechBay LLC is looking for a Base QA Engineer. His/ her responsibilities will include: participating in the product requirements' analysis sessions, planning, prioritizing and estimating the testing process, testing existing product and newly developed features of the product, writing and executing test cases, documenting and prioritizing the product issues, reporting. The jobholder will also participate in some of the quality control processes, such as assuring unit test coverage metrics meet requirements, tracking test metrics, assuring the QA processes are sustainable within the Company.","job_responsibilities":"- Get full knowledge of the product functionality within 1-2 months;- Review and understand the upcoming product requirements;- Plan and estimate the test execution process;- Design and execute test cases based on product/ feature requirements;- Identify, reproduce, prioritize and document product issues;- Test existing product and newly developed features based on requirements;- Execute regression test cycles to ensure the best possible quality of the product;- Identify bottlenecks and devise solutions to the problems;- Provide daily status QA reports;- Track the quality and test metrics;- Take actions in continuously improving the QA procedures with the Company;- Help with researching, setup and maintaining tools to simplify the Quality Control procedures;- Help with developing CI (Continuous Integration) procedures;- Participate in preparing test data for Test Automation scripts.","required_qualifications":"- At least 3 years of experience as a QA Engineer;- Strong knowledge of software QA methodologies, tools and processes;- Experience in creating effective test cases;- Excellent analytical and multitasking skills;- Experience in mobile applications testing;- Person technically inclined to software products and tools;- Ability to work under pressure and with deadlines;- Strong problem-solving skills;- Self-organized, fast-working, self-learning personality;- Team worker with ability to share knowledge within a team;- Higher technical education is a big plus;- Knowledge of test automation tools is a plus;- Knowledge of coding is a plus;- Understanding of code versioning tools is a plus.","remuneration_salary":"Highly competitive","application_procedures":"All interested and qualified candidates are encouraged to send their CVs to: <a href=\"mailto:hr@zeroapp.ai\">hr@zeroapp.ai</a> .  Please clearly mention in your application letter that you learned of this job opportunity through Career Center and mention the URL of its website - <a target=\"_blank\" href=\"http://www.careercenter.am\">www.careercenter.am</a>, Thanks.","opening_date":"15 November 2017","application_deadline":"14 December 2017","about":"TechBay LLC works on AI based mobile email client Zero email application. Please see more at: <a target=\"_blank\" href=\"http://www.zeroapp.ai\">www.zeroapp.ai</a>."},{"id":30033,"company":"Tumo Center for Creative Technologies","title":"Content Development Section Coordinator","duration":"Permanent","location":"Yerevan, Armenia","job_description":"Tumo Center for Creative Technologies is looking for a highly motivated and dynamic professional who will lead Content Development Section's daily activities and educational content creation process.","job_responsibilities":"- Coordinate daily activities of the Content Development Section ensuring high productivity;- Participate in the Content Development Section's hiring process; - Coordinate content creation process; - Be involved in  educational interfaces' new models, releases and features development/ design and their maintenance process;- Cooperate closely with other departments and units;- Prepare and coordinate all the logistical arrangements for the workshops in all Tumo centers;- Annual planning for the workshop leaders travelling to all Tumo centers;- Perform monthly check-ups on workshop leader's plans and business trip's schedule;- Plan working hours, vacations and days off for the permanent workshop leaders;- Arrange transportation and accommodation for the workshop leaders during their business trips;- Oversee the number of Tumo students' enrollment in workshops;- Work with the Tumo branches to create reports on students' attendance;- Follow up on all Content Development Team duties, including activity examination, proper assignment, workshop quality and  final results, etc.;- Prepare weekly and monthly reports on workshop subscriptions and students' flow;- Responsible for workshop scheduling for school visits and summer camp;- Responsible for permanent workshop scheduling;- Perform other job-related duties as may be assigned.","required_qualifications":"- University degree from a leading institution;- Experience in the field of education  is a plus;- Managerial experience is a plus;- Ability to develop educational curriculum, learning assignments and educational projects;- Multifaceted aptitudes and ability to learn technical concepts;- Willingness to develop innovating skills;- Strong communication skills and research abilities;- Ability to work well both independently and as the team member of a large workforce;- Ability to create healthy work environment and maintain corporate ethics.","application_procedures":"Interested candidates should submit a resume and portfolio to: <a href=\"mailto:jobs@tumo.org\">jobs@tumo.org</a> by the deadline. In the subject line of your email, please mention \"Content Development Section Coordinator\". Only short-listed candidates will be notified.  Please clearly mention in your application letter that you learned of this job opportunity through Career Center and mention the URL of its website - <a target=\"_blank\" href=\"http://www.careercenter.am\">www.careercenter.am</a>, Thanks.","opening_date":"16 November 2017","application_deadline":"15 December 2017","about_company":"Tumo is a free after-school program designed for teens. Since the program's launch in 2011, four Tumo centers have opened their doors in Armenia: in Yerevan, Dilijan (in collaboration with the Central Bank), Gyumri and Stepanakert (in collaboration with AGBU). A new, fifth Tumo center is planned to launch in the northern border village of Koghb, in Tavush, in 2018. Under the Tumo educational program, students get acquainted with four main focus areas: animation, web design, game development and film making; and ten complementary skills including robotics, programming, photography, music, and more."},{"id":30034,"company":"HSBC Bank Armenia CJSC","title":"AML Investigator","open_to/ eligibility criteria":"All qualified candidates.","start_date/ time":"ASAP","location":"Yerevan, Armenia","job_description":"HSBC Bank Armenia CJSC is looking for an AML Investigator to perform the below mentioned responsibilities.","job_responsibilities":"- Conduct initial analysis of customer transactions using internal/ external research tools in order to assess and determine if the transactions seem plausible or if there is reasonable suspicion that the transaction involves money laundering; - Identify suspicious or unusual transactions, non-compliant activity or increased compliance risk; - Accurately document rationale for case closure at Level 1 or proceed with a Level 2 investigation;- Prepare customer transaction analysis summaries on request; - At Level 2 research and investigate systemic alerts to determine whether the activity relating to the customer account is unusual from an AML perspective. Once the investigation is complete the AML Investigator must document the findings and either close the case or refer the case to the AML Investigation team. - Review the Unusual Activity reports (UARs) raised and analyze whether any further information requests are relevant or further escalation to Level 3 is required;- Conduct day-to-day operations of local AML Investigations, including searches requested from the group as well as escalation requests form the front line (Group search requests, World check match escalations, non sanctions related, etc.);- Prepare and submit MI related to the processed alerts and UARs;- Understand the nature and importance of the data and information needed to provide compliance assurance for their assigned areas of activity or business; - Follow processes and use appropriate templates and reporting standards to ensure work is delivered in accordance with relevant timetables, quality standards and internal policies and procedures;- Perform transactions monitoring to ensure that unusual activity is identified in a timely manner and escalated in accordance with procedures;- Undertake specific information and data gathering, check and report in support of Compliance audits, projects and reviews, producing accurate, on-time outputs to the expected standards;- Review the alerts generated by HSBC Group application and ensure the anomalous activities are escalated in accordance with regulatory requirements where appropriate;- Build on the knowledge of latest  anti money laundering trends and relevant local regulatory requirements;- Achieve the levels of productivity and quality as per the standards, agreed for the process;- Understand and adhere to established policies and procedures in the team;- Work under pressure, in a multi-task environment; - Support implementation of changes and initiatives in a timely manner.","required_qualifications":"- At least 2 years of experience in HSBC or other financial institution;- Sound knowledge of AML related legislation;- Availability of a relevant license from the Central Bank of Armenia (can be obtained within 3 months after the appointment); ability to pass the registration process with the License Committee of CBA as a member of the Internal Monitoring Unit (considered as a managerial position in the Bank and related party to the Bank);- Experience in FCC or equivalent environment; - Experience in undertaking investigations/ analysis to the customer activity with the ability to draw inferences from the information;- Ability to take decisions and tactfully handle sensitive and confidential data;- Computer literacy, strong knowledge of MS Office and ability to quickly adapt to new software applications;- Excellent oral and written communication skills;- Good knowledge of Armenian, English and Russian languages; - Ability to work under pressure with strict deadlines.","remuneration_salary":"Competitive","application_procedures":"All the interested and qualified candidates are encouraged to fill in the last updated version of HSBC Application Form attached below and send it to: <a href=\"mailto:vacancy.armenia@hsbc.com\">vacancy.armenia@hsbc.com</a> . The old versions of application forms will not be reviewed. Please, put \"AML Investigator\" in the subject line of the email. Only short-listed candidates will be invited for interviews.  Please clearly mention in your application letter that you learned of this job opportunity through Career Center and mention the URL of its website - <a target=\"_blank\" href=\"http://www.careercenter.am\">www.careercenter.am</a>, Thanks.","opening_date":"17 November 2017","application_deadline":"28 November 2017","about_company":"HSBC Bank Armenia was established as a Closed Joint Stock Company under the name Midland Armenia Bank J.S.C. in 1996 and has been renamed into HSBC Bank Armenia CJSC in 1999. The Bank is a joint venture between the HSBC Group, which has a 70 percent ownership, and the members of overseas Armenian businesses with 30 percent ownership. HSBC Bank Armenia CJSC offers products and services to individuals, as well as to corporate customers in Armenia and abroad.","attachments":""},{"id":30037,"company":"\"Armenian Caritas\" Benevolent NGO","title":"External Evaluator","term":"Part-time","open_to/ eligibility criteria":"Only individual experts can apply","start_date/ time":"10 January 2018 - 15 March 2018","duration":"2 months","location":"Gyumri, Armenia","job_description":"\"Armenian Caritas\" Benevolent NGO is looking for an External Evaluator to perform a mid-term evaluation of the project \"Family-oriented support for children and adolescent in critical circumstances\". The evaluation should cover implementation period of the project \"Family-oriented support for children and adolescent in critical circumstances,\" from January 2016 to January 2018 for some questions, which long term perspective the previous phases can be also taken into account. The geographical area of the evaluation is Gyumri city of Shirak province and Tashir town of Lori province, Armenia. Locations: \"Armenian Caritas\" office in Gyumri, \"Little Prince\" Day Care center in Gyumri and \"Little Prince\" Day Care center in Tashir.The evaluation shall especially scope 4 out of 5 Development Assistance Committee (DAC)-Criteria, which are: effectiveness, relevance, efficiency and sustainability. Since it is a midterm evaluation these categories seem to be crucial: the recommendations shall help to adapt the activities respectively. The DAC Criteria \"Impact\" will not be covered by this mid-term evaluation. \"Impact,\" which is measuring the long-term outcomes of the project, can, from the Organization's estimation of the project results so far, only be assessed in the end of the project. Parts of the questions related to \"impact\" (like long-term effects of interventions, difference the intervention makes for the project beneficiaries) will be covered by the questions related to the \"sustainability\" of the action.","required_qualifications":"Personal: - Education and work experience relevant to the task at hand;- Knowledge of English language; knowledge of Armenian language for local evaluator;- Team player;- Intercultural competency;- Physical fitness.Work experience:- Experience in development cooperation;- Work experience abroad for foreign evaluator.General evaluation-specific competencies:- Theoretical and methodological basics of evaluation (basic terms, concepts, etc.);- Planning and implementation of evaluations (incl. budgeting, contractual agreements);- Professional standards;- Specific methods and concepts of evaluation (and quality control).Methodical competencies:- Methodology and methods of empirical social research (quantitative and qualitative procedures, simple and complex procedures of data analysis and data processing);- Methods of business management (e.g. accounting);- Evaluation methods;- Methods of project management (methods of time, cost and implementation planning).Context-related competencies:- Expert knowledge in the respective environment;- Knowledge regarding general conditions/ structures in the environment (especially policies which have direct impact on evaluations in this area);- Specific models used in the environment, procedures and methods of evaluation;- Interdisciplinary, general knowledge in the areas of organization, communication, etc.","application_procedures":"To apply interested candidates should provide:- CV;- Copies of the previous evaluations;- References;- Motivation letter;- Evaluation proposal (including: methods, activities, timeframe and budget).The aforesaid documents should be sent to: <a href=\"mailto:info@caritas.am\">info@caritas.am</a> and <a href=\"mailto:h.sargsyan@caritas.am\">h.sargsyan@caritas.am</a> .  Please clearly mention in your application letter that you learned of this job opportunity through Career Center and mention the URL of its website - <a target=\"_blank\" href=\"http://www.careercenter.am\">www.careercenter.am</a>, Thanks.","opening_date":"17 November  2017","application_deadline":"27 November 2017, by COB","about_company":"\"Armenian Caritas\" (AC) sees itself as the expression and an instrument of charity of the Armenian Catholic Church. Accordingly, \"Armenian Caritas\" seeks to organize and implement humanitarian and charitable actions in favor of persons and social groups living under difficult conditions without religious, national or racial discrimination. \"Armenian Caritas\" views itself as an important force in actively promoting the democratic and developmental changes in Armenia and strives to work with families, uphold family values, and empower parents to be involved in healthy parenting values, thus implementing more, than 40 projects in different spheres of its Strategic directions. Since the day of its establishment in 1995 \"Armenian Caritas\" has implemented numerous projects targeting children and their families. As a result of implementation of these projects \"Armenian Caritas\" came to the decision to continue its efforts to family-based support, keeping main focus on child care and protection in family environment. Creating day care social centers for children and families since 2009 \"Armenian Caritas\" provides community-based complex services to the disadvantaged children and parents by means of multi professional staff.","attachments":""},{"id":30038,"company":"IDeA Foundation","title":"Coordinator for Web Application Development","term":"Part-time","open_to/ eligibility criteria":"All interested candidates","start_date/ time":"08 January 2018","duration":"The contract duration is 4 months (from 08 January 2018 to 08 May 2018).","location":"Yerevan, Armenia","job_responsibilities":"- Closely cooperate with the web development team to secure the smooth implementation of all assigned tasks and ensure strict respect towards deadlines;- Gather and refine specifications and requirements based on technical needs;- Constantly monitor possible issues and assist the web development team in their solution;- Perform ongoing testing and quality control; - Report on project development;- Ensure that the website and web application are in harmony with other components of the project.","required_qualifications":"- University degree, preferably in IT;- Hands-on experience with web applications and programming languages such as HTML, CSS, JavaScript, JQuery, and API;- Excellent written and verbal communication skills in English, Armenian, and Russian languages;- Experience in planning and delivering software platforms used across multiple products and organizational units;- Demonstrated strong oral and written communication skills, facilitation, negotiation and interpersonal skills;- Ability to work independently;- Well-developed planning, organization, and problem-solving skills.","application_procedures":"All interested candidates are kindly requested to submit their CV to: <a href=\"mailto:hr@idea.am\">hr@idea.am</a> . Please, indicate the title of the position \"Coordinator for Web Application Development\" in the subject line of your e-mail. IDeA Foundation is grateful to all interested applicants; however, only shortlisted candidates will be contacted for the interview.  Please clearly mention in your application letter that you learned of this job opportunity through Career Center and mention the URL of its website - <a target=\"_blank\" href=\"http://www.careercenter.am\">www.careercenter.am</a>, Thanks.","opening_date":"13 November 2017","application_deadline":"01 December 2017","about_company":"IDeA (Initiatives for Development of Armenia) Charitable Foundation was established by the entrepreneurs and philanthropists Ruben Vardanyan and Veronika Zonabend. The Foundation focuses on programs which achieve tangible socioeconomic development and assist Armenia in transition from the survival model to the prosperity model. IDeA is committed to promoting social entrepreneurship in Armenia through investments in long-term, non-profit projects, as well as ensuring their sustainability."},{"id":30039,"company":"Sef International UCO LLC","title":"Regional Operations Manager","location":"Yerevan, Armenia","job_description":"The Regional Operations Manager is responsible for the overall performance of 5 branches by providing financial services in these branches.","job_responsibilities":"- Be accountable to the Executive Director for the Institution's overall results within the geographical area of responsibility and their compliance with the business plan and operational policies and procedures;- Take into consideration customers' needs, overall strategy and objectives; contribute in design, and be responsible for implementation of the business plan and strategies for the Institution's activities and growth of the areas under his/ her supervision;- Lead the development of the branches' operational targets, and ensure they are executed and achieved through effective leadership, management, evaluation and reporting; - Accountable for the overall financial results of the branches; ensure the financial probity and cost-efficiency of all branch activities and keep the branches operationally self-sustainable;- Launch and efficiently expand operations in new areas and in new markets;- Provide direct supervision of the branch managers and other direct reports ensuring the branch activities are carried out with a high commitment to the customers' needs and SEF strategic objectives, mission and vision;- Build and utilize efficient delinquency management and strong risk management in operations;- Contribute in development and lead the implementation of operational and marketing policies and procedures;- Build a high-quality customer service providing an appropriate product range that meets clients' needs and aims to increase both the number of clients served and the portfolio outstanding;- Ensure the full compliance of SEF operations with the requirements of the SEF Charter, the local legislation and the Central Bank of Armenia (CBA);- Contribute in SEF strategic and financial planning;- Manage the promotion of SEF activities and raise the Institution's profile building positive and fruitful relations with partners and potential clients.","required_qualifications":"- University degree in Management, Economics or Finance;- Postgraduate education or training in Management and Marketing is preferred;- At least 5 years of prior work experience directly related to the duties and responsibilities specified;- Budgeting and planning experience in a financial institution is a plus.Capacity and Skills- Knowledge of the Armenian law, the CBA, government and tax regulation and reporting requirements as applicable to credit institutions;- Knowledge of the Armenian financial system, the Armenian financial market, its major players, and modern developments; skills in strategic and operational marketing;- Familiarity with modern financial products, services and technologies;- Knowledge of the loan institution's specifics including the business model, technologies and the structure;- Business/ financial analysis techniques;- Ability to institute policies and procedures, and make operational corrections and modifications;- Excellent time management skills with the ability to prioritize and meet deadlines;- Strong managerial capacity and decision-making skills;- Skills and ability to manage people in a remote physical location;- Excellent interpersonal and communication skills, both written and verbal, and an ability to communicate and work effectively within a diverse community; team building skills;- Fluency in the Armenian language; good knowledge of the English language (written and verbal); knowledge of the Russian language is a plus;- Honesty and strong commitment to the SEF vision and values;- Ability to travel within RA.Software and Computer Literacy- Knowledge of the information systems used in financial institutions; knowledge of ArmSoft AS Bank is desirable;- Strong computer skills in MS Office applications, in particular Word, Excel and PowerPoint; experience with MS Project is a plus.","application_procedures":"To apply for this position or for further information, please e-mail your CV to: <a href=\"mailto:regionalmanager@sef.am\">regionalmanager@sef.am</a> .Please, mention in the subject line of the message the position for which you are applying for. Only short-listed candidates will be contacted and invited for the interview.  Please clearly mention in your application letter that you learned of this job opportunity through Career Center and mention the URL of its website - <a target=\"_blank\" href=\"http://www.careercenter.am\">www.careercenter.am</a>, Thanks.","opening_date":"13 November 2017","application_deadline":"30 November 2017","about_company":"SEF International Universal Credit Organization was founded in 1998 by World Vision International Christian Charitable Organization to carry out a full-range of credit activities through urban and rural branches in Armenia. Since 2003 SEF is licensed and regulated by the Central Bank of Republic of Armenia. Currently SEF International is owned by VisionFund International – a subsidiary of WVI specialized in microfinance. Currently SEF is operating through two branches in Yerevan, branch offices in Gyumri, Artik, Goris, Sisian, Kapan, Meghri, Yeghegnadzor, Masis, Artashat, Vedi, Armavir, Ejmiatsin, Talin,  Aparan,  Ijevan, Noyemberyan, Vanadzor, Stepanavan, Gavar and Abovyan. The majority of SEF clients are located in the poorest rural communities."},{"id":30040,"company":"Children of Armenia Fund (COAF)","title":"Chief Accountant","location":"Yerevan, Armenia","job_description":"The Children of Armenia Fund (COAF) is seeking a highly experienced and motivated Chief Accountant to support COAF operations in Armenia in general, and Finance Team activities in particular. The Chief Accountant will be responsible for conducting accounting in full compliance with Armenian and international accounting standards. The incumbent will join the team of finance professionals and be directly responsible for overseeing all areas of the accounting function, including payroll, accounts payable, accounts receivable, cash flow, General Ledger operations, tax filings, and other financial activities as applicable. The person-in-charge will also ensure timely preparation of financial/ accounting reports, submission of all mandatory statutory reports, ensuring their compliance with laws and regulations.","job_responsibilities":"- Conduct accounting in full compliance with Armenian legislation and COAF internal policies;- Record all financial activities to the financial software; - Record and keep accounting data and projects' reports; - Enter accounting data and record financial transactions from the receipts and payment vouchers into a general journal/ accounting software on a daily basis; - Compile and check all invoices, prepare payment and transfer orders; - Check bank balances and upon need deposit, withdraw or make internal transfer of funds; - Prepare and follow up with bank transaction orders; - Prepare payroll on a regular basis; - Calculate, prepare and transfer all required state taxes and perform other job-related obligations; - Conduct regular warehouse/ inventory control; - Summarize current financial status by collecting information, preparing balance sheet, profit and loss statement, and other reports; - Prepare and submit all required financial documents and reports (on monthly, quarterly and annual basis); - Participate in planning of annual budgets; - Adhere to the policies and procedures set by COAF, follow the accounting standards and norms, as well as tax laws and regulations; - Assist in auditing activities by providing necessary information and preparing requested documentation; - Substantiate financial transactions by auditing documents; - Review and recommend changes to existing accounting procedures working closely with the CFO and financial team; - Cooperate closely with COAF program teams; - Perform other duties related to accounting and finance.","required_qualifications":"- Master's degree in Finance, Economics or a related field;- At least 7 years of professional experience in accounting; - Good knowledge of ArmSoft and basic knowledge of QuickBooks accounting; - Sound knowledge of accountancy, financial business processes and reporting standards, including IFRS; - Excellent knowledge of Tax Legislation of the Republic of Armenia; - ACCA qualification is a plus; - Good judgement, strong analytical and time-management skills; - High organizational skills and sense of responsibility; - Ability to work under pressure; - Ability to work independently and highly meticulously;- Budgeting and budget management skills; - Excellent communication and interpersonal skills; - Excellent written and verbal communication skills in Armenian language; good knowledge of English and Russian languages; - Good IT literacy: Accounting Software, MS Office, Outlook, and Internet.","application_procedures":"Interested candidates are requested to send a Curriculum Vitae (CV) in Armenian or English language to: <a href=\"mailto:coaf@coafkids.org\">coaf@coafkids.org</a> by the mentioned deadline. The name of the position should be indicated in the subject line of the e-mail. Incomplete applications or those received after the deadline will not be considered. Only shortlisted candidates will be contacted and invited for an interview.  Please clearly mention in your application letter that you learned of this job opportunity through Career Center and mention the URL of its website - <a target=\"_blank\" href=\"http://www.careercenter.am\">www.careercenter.am</a>, Thanks.","opening_date":"13 November 2017","application_deadline":"20 November 2017, 6:00 p.m.","about_company":"The Children of Armenia Fund (COAF) is a non-profit, non-governmental organization that employs community-led approaches aimed at improving the quality of life in rural Armenia, with a particular focus on children and youth. COAF's target development areas are education, healthcare, child and family support, socio-economic development. COAF launched its programs in 2004, starting in one village and expanding to forty-four villages in Armavir, Aragatsotn, Lori, Gegharkunik, Shirak and Tavush regions, impacting the total population of 48,000 people. Since 2015 COAF has developed and started implementing a new vision – SMART Initiative. SMART is designed to advance a generation across the rural world through education that will benefit individuals, societies, and the environment. SMART will become an exemplary model of development and will be replicated in other regions and communities throughout Armenia."},{"id":30041,"company":"Lavr LLC","title":"Front-end Developer","location":"Yerevan, Armenia","job_description":"Lavr LLC is looking for a qualified Front-end Developer to join its team. The jobholder's primary focus will be creating new and maintaining the existing services, writing clear and maintainable code. The Front-end Developer will be responsible for building the \"client-side\" of the Company's web applications.","required_qualifications":"- Knowledge of and strong expertise in AngularJS, HTML5 and TypeScript;- Strong knowledge of Internet technologies and XML integration, including XML-Schema, XML-RPC, XML-SOAP, REST, and/ or Web Services/ SOA;- Experience in Websockets and Realtime high-load projects;- Knowledge of Agile and experience in Scrum is essential;- Strong verbal and written communication skills;- Broad experience with front-end UI development, interface with back-end API and object-oriented software design/ development;- Continuous integration and automated deployment experience for multi-branched and multi-module projects;- Strong focus on code quality, related to analytic tools and understanding of functional and nonfunctional requirements;- Ability to understand, use and justify design patterns;- Ability to use and build/ maintain frameworks, using HTML5/ Angular JS/ React;- Ability to articulate usage of HTML 5, Angular JS/React  in scenario's defined and defend solutions;- Demonstrated knowledge of code reviews, unit and regression testing;- Self-starter, positive and excited to work with a team of excellent engineers;- Very strong communication and collaboration skills;- Continuous integration and automated deployment experience with multi-module projects.","application_procedures":"To apply, please send your CV to: <a href=\"mailto:hr@lavr.am\">hr@lavr.am</a> .  Please clearly mention in your application letter that you learned of this job opportunity through Career Center and mention the URL of its website - <a target=\"_blank\" href=\"http://www.careercenter.am\">www.careercenter.am</a>, Thanks.","opening_date":"21 November 2017","application_deadline":"20 December 2017","about_company":"Lavr LLC is an IT company."}]